SEMANA_3/blockchain-forense-kubernetes/README.md
```mermaid
flowchart TB
    U[Usuario / investigador] --> SVC[Service forense-api]

    subgraph DEP[Deployment forense-api - replicas: 3]
        RS[ReplicaSet]
        P1[Pod API 1]
        P2[Pod API 2]
        P3[Pod API 3]
        RS --> P1
        RS --> P2
        RS --> P3
    end

    SVC --> P1
    SVC --> P2
    SVC --> P3

    P1 --> GU[Service geth-utpl]
    P2 --> GU
    P3 --> GU

    subgraph BC[Red blockchain privada Clique]
        GU --> N1[StatefulSet Geth UTPL + PVC]
        GM[Service geth-ministerio] --> N2[StatefulSet Geth Ministerio + PVC]
        GA[Service geth-auditora] --> N3[StatefulSet Geth Auditora + PVC]
        N1 <--> N2
        N1 <--> N3
        N2 <--> N3
    end

    J[Job deploy-registro-evidencias] --> GM
    J --> SC[Smart contract]
```
